src/cfe/КСП/DataProcessors/ксп_АнонсПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ксп_АнонсПоставки</Name>
			<Comment>ФормированиеФайлаXMLПоФормату_FE720</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КСП_ДиспетчерРаспределения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_НеНуженВРознице</Name>
					<Comment>Истина, если не надо загружать в 1С:Розница</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьДлительностьПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_УровеньРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_СозданАвтоматически</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/DataProcessors/ксп_АнонсПоставки/Ext/ObjectModule.bsl
// Анонс поставки
// Формирование XML файла по формату FE714 на основании документа продажи.
//
// Параметры:
//  СсылкаОрдерНаПродажу  	- СсылкаДокументы.ЗаказНаПеремещение
//  ПутьКФайлуВыгрузки  	- Строка - путь к файлу выгрузки 
//	ОписаниеОшибки			- Описание ошибки , если она есть 
//
// Возвращаемое значение:
//   булево   - истина если удалось сделать выгрузку , иначе ложь и описание ошибки .
Функция ФормированиеФайлаXMLПоФормату_FE720(СсылкаОрдерНаПродажу, ПутьКФайлуВыгрузки, UUIDФайла, ДатаФормированияФайла,  Лог)  Экспорт
	
	Если не ЗначениеЗаполнено(СсылкаОрдерНаПродажу) Тогда
		ксп_Элис_ОбщегоНазначения.ЗаписатьВЛог(Лог,  "Файл выгрузки Анонса поставки не сформирован. Пустая ссылка на документ ""Заказ на перемещение""", "ERR");
		ВызватьИсключение "Файл выгрузки Анонса поставки не сформирован. Пустая ссылка на документ ""Заказ на перемещение""";
	КонецЕсли;
	
	// собираем данные для выгрузки из БД в табилцы 
	
	#Область ПоляЗапросаДляАнонсаПоставки
	//UUID		- Номенклатура
	//size		- ХарактеристикаНоменклатуры
	//ean			- "не передаем" 
	//quantity	- Количество
	//price		- Цена
	//labelCode	- ШтрихКод
	#КонецОбласти

	ТипЦенДляАнонсаПоставки = Справочники.ВидыЦен.НайтиПоНаименованию("Прайс-лист", Истина);// еще есть "Розничные цены"
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляВыгрузкиНоменклатурыПоФормату_FE720();
	Запрос.УстановитьПараметр("СсылкаОрдерНаПродажу", СсылкаОрдерНаПродажу);
	Запрос.УстановитьПараметр("ТипЦенПараметр", ТипЦенДляАнонсаПоставки);
	
	//Поликарпов А.А. 13.09.23 обр.0000060126
	//Запрос.Параметры.Вставить("ДатаДок"	, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаОрдерНаПродажу,"Дата"));
	// ЕНС. отключил 
//	ДокПродажа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаОрдерНаПродажу,"ДокументПродажи"); 
	// ЕНС . В УПП это
	// - ВозвратПоставщику
	// - Перемещение
	// - Продажа
	// В ЕРП:
	// - ПеремещениеТоваров
	ДатаПродажи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаОрдерНаПродажу,"Дата");//ЕНС поменял ДокПродажа на СсылкаОрдерНаПродажу
	//Если Не ЗначениеЗаполнено(ДатаПродажи) Тогда                                
	//	ксп_Элис_ОбщегоНазначения.ЗаписатьВЛог(Лог,  "Файл выгрузки не сформирован. Нет документа <Перемещение товаров> или в нем не заполнена дата (что невозможно, т.к. без даты он не запишется)", "ERR");
	//	Возврат ложь;
	//КонецЕсли;
	Запрос.Параметры.Вставить("ДатаДок", ДатаПродажи); 
	
	МассивПакетов = Запрос.ВыполнитьПакет();

	СмещениеИндекс = 5;
	
	#Область FE720_ПоляНоменклатуры
	//Номенклатура                            
	//ХарактеристикаНоменклатуры
	//Количество
	//Цена
	//ОбязательнаяМТ                            
	#КонецОбласти
	ТабНоменклатура 		= МассивПакетов[СмещениеИндекс + 0].Выгрузить();	
	
	#Область FE720_ПоляШтрихкоды
	//ХарактеристикаНоменклатуры
	//ШтрихКод
	#КонецОбласти
	ТабШтрихкоды 		= МассивПакетов[СмещениеИндекс + 1].Выгрузить();	
	
	//FE720
	// Вспомогательная структура для рекурсивного заполения , в ней хранятся узлы XDTO и константы значения для заполнения
	Параметры = новый Структура;
	
	Параметры.Вставить("ПространствоИмен","http://service.profashionsolutions.ru/fe720_r002"); 
	
	// константы  
	НастройкиФФ = ОбменСФулфилментСервер.ПолучитьНастройкиФулфилментДляТекущейБазы();
	Параметры.Вставить("Shop", 	НастройкиФФ.Shop);  
	Параметры.Вставить("Token",	НастройкиФФ.Token); 
	
	// берем коренвое свойство 
	Имя_shipmentAnnouncementRequest = "shipmentAnnouncementRequest";
	Объект_shipmentAnnouncementRequest = ОбменСФулфилментСервер.ПолучитьОбъектМоейФабрики(Параметры, Имя_shipmentAnnouncementRequest);
	
	// сформировали пустой скелет что бы не делать этого руками 
	ОбменСФулфилментСервер.ЗаполнитьПустымиСвойствамиОбъектРекурсивно(Параметры, Объект_shipmentAnnouncementRequest);
	
	// заполняем параметры поставки 
	
	Параметры.service.shop 			=  Параметры.shop;
	Параметры.service.token 		=  Параметры.token;
	Параметры.service.messageId 	=  UUIDФайла;
	Параметры.service.messageDate 	=  ОбменСФулфилментСервер.ПолучитьДатуСтрокойФомата_XSD_duration(ДатаФормированияФайла); //"P2023Y03M11DT13H33M22S"; //ДатаФормированияФайла-'00010101';  //duration  xsd:duration
	
	Для каждого СтрНоменклатура Из ТабНоменклатура Цикл
		item = ОбменСФулфилментСервер.ПолучитьОбъектМоейФабрики(Параметры, "ctItemRequest");
		
		item.uuid 		= строка(СтрНоменклатура.Номенклатура.УникальныйИдентификатор());
		item.size 		= строка(СтрНоменклатура.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
		item.quantity   = СтрНоменклатура.Количество;
		item.price		= СтрНоменклатура.Цена;
		
		item.ean		= "";
		
		
		labelCodes		= ОбменСФулфилментСервер.ПолучитьОбъектМоейФабрики(Параметры, "ctlabelCodes");
		
		НайденыеШтрихкоды = ТабШтрихкоды.найтиСтроки(Новый Структура("ХарактеристикаНоменклатуры",СтрНоменклатура.ХарактеристикаНоменклатуры));
		Для каждого СтрШтрихкод Из НайденыеШтрихкоды Цикл
			
			DataMatrix = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"01%121%2",
				сред(СтрШтрихкод.ШтрихКод,1,14),
				сред(СтрШтрихкод.ШтрихКод,15));
			
			labelCodes.labelCode.Добавить(DataMatrix);
		КонецЦикла;
		
		item.labelCodes = labelCodes;
		
		Параметры.items.item.Добавить(item);
	КонецЦикла;

	
	
	Попытка
		МойXML = Новый ЗаписьXML;
		МойXML.ОткрытьФайл(ПутьКФайлуВыгрузки, "UTF-8");
		МойXML.ЗаписатьОбъявлениеXML();
		ФабрикаXDTO.ЗаписатьXML(МойXML, Объект_shipmentAnnouncementRequest, Имя_shipmentAnnouncementRequest);  
		МойXML.Закрыть();
	Исключение
		Сообщение  = СтрШаблон("Ошибка записи выгрузки анонса поставки XML. Причина: %1", ОписаниеОшибки());
		ксп_Элис_ОбщегоНазначения.ЗаписатьВЛог(Лог, Сообщение, "ERR");
		ВызватьИсключение;		
	КонецПопытки;
	
	Сообщение  = СтрШаблон("Сформировали файл выгрузки анонса поставки. Количество элементов номенклатуры %1 шт.", ТабНоменклатура.Количество());
	ксп_Элис_ОбщегоНазначения.ЗаписатьВЛог(Лог, Сообщение);


	возврат истина;
КонецФункции // ()

// Анонс поставки
Функция ПолучитьТекстЗапросаДляВыгрузкиНоменклатурыПоФормату_FE720()
     ТекстЗапроса =
	//  "ВЫБРАТЬ
	//|	ОрдерНаПродажуТовары.Номенклатура,
	//|	ОрдерНаПродажуТовары.ХарактеристикаНоменклатуры,
	//|	СУММА(ОрдерНаПродажуТовары.Количество) КАК Количество,
	//|	ОрдерНаПродажуТовары.ШтрихКод
	//|ПОМЕСТИТЬ ВтТовары
	//|ИЗ
	//|	Документ.ОрдерНаПродажу.Товары КАК ОрдерНаПродажуТовары
	//|ГДЕ
	//|	ОрдерНаПродажуТовары.Ссылка = &СсылкаОрдерНаПродажу
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОрдерНаПродажуТовары.ШтрихКод,
	//|	ОрдерНаПродажуТовары.ХарактеристикаНоменклатуры,
	//|	ОрдерНаПродажуТовары.Номенклатура
	//|;
	
	"ВЫБРАТЬ
	|	ОрдерНаПродажуТовары.Номенклатура КАК Номенклатура,
	|	ОрдерНаПродажуТовары.Характеристика КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ВтТовары_предв
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ОрдерНаПродажуТовары
	|ГДЕ
	|	ОрдерНаПродажуТовары.Ссылка = &СсылкаОрдерНаПродажу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВтШтрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВтТовары_предв.Номенклатура
	|			ИЗ
	|				ВтТовары_предв КАК ВтТовары_предв)
	|	И ШтрихкодыНоменклатуры.Характеристика В
	|			(ВЫБРАТЬ
	|				ВтТовары_предв.ХарактеристикаНоменклатуры
	|			ИЗ
	|				ВтТовары_предв КАК ВтТовары_предв)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрдерНаПродажуТовары.Номенклатура КАК Номенклатура,
	|	ОрдерНаПродажуТовары.Характеристика КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВтШтрихкоды.Штрихкод, НЕОПРЕДЕЛЕНО) КАК ШтрихКод,
	|	СУММА(ОрдерНаПродажуТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтТовары
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ОрдерНаПродажуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтрихкоды КАК ВтШтрихкоды
	|		ПО (ВтШтрихкоды.Номенклатура = ОрдерНаПродажуТовары.Номенклатура)
	|			И (ВтШтрихкоды.Характеристика = ОрдерНаПродажуТовары.Характеристика)
	|ГДЕ
	|	ОрдерНаПродажуТовары.Ссылка = &СсылкаОрдерНаПродажу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтШтрихкоды.Штрихкод,
	|	ОрдерНаПродажуТовары.Характеристика,
	|	ОрдерНаПродажуТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВтНоменклатура
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ВтЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаДок,
	|			ВидЦены = &ТипЦенПараметр
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВтНоменклатура.Номенклатура
	|					ИЗ
	|						ВтНоменклатура КАК ВтНоменклатура)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТовары.Номенклатура КАК Номенклатура,
	|	ВтТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВтТовары.Количество) КАК Количество,
	|	ЕСТЬNULL(ВтЦены.Цена, 0) КАК Цена,
	|	ВтТовары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар КАК ОбязательнаяМТ
	|ИЗ
	|	ВтТовары КАК ВтТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
	|		ПО ВтТовары.Номенклатура = ВтЦены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТовары.Номенклатура,
	|	ВтТовары.ХарактеристикаНоменклатуры,
	|	ВтТовары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар,
	|	ЕСТЬNULL(ВтЦены.Цена, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВтТовары.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВтТовары КАК ВтТовары";
	// ЕНС. Это под вопросом.
	//|ГДЕ
	//|	ВтТовары.Номенклатура.КодТНВЭД.ПрослеживаемыйТовар = ИСТИНА";
	
	Возврат ТекстЗапроса;
КонецФункции
